---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElemRoomName
source: html/d173cbf9-9d27-e8e8-737c-04101e6d1ea7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElemRoomName Property

"Room Name"

## Syntax (C#)
```csharp
public static ForgeTypeId ElemRoomName { get; }
```